{
  "datasets": [
    {
      "id": "edc_df",
      "file": "edc_df.csv",
      "title": "EDC Dataset",
      "description": "Contains clinical visit records detailing subject dosing information and any reported adverse events."
    },
    {
      "id": "epro_df",
      "file": "epro_df.csv",
      "title": "ePRO Dataset",
      "description": "Captures self-reported symptoms and their severity from subjects over time."
    },
    {
      "id": "ivrs_df",
      "file": "ivrs_df.csv",
      "title": "IVRS Dataset",
      "description": "Records subject randomization details, including assigned drug kits, countries, and dose groups."
    },
    {
      "id": "lab_df",
      "file": "lab_df.csv",
      "title": "Lab Dataset",
      "description": "Patient Lab Test Results Dataset"
    },
    {
      "id": "entity_df",
      "file": "entity_df.csv",
      "title": "Entity Dataset",
      "description": "This dataset contains legal, organizational, and regulatory details of various registered entities, including incorporation authority, financial classification flags, business status, and size-related attributes."
    }
  ],
  "column-description": {
    "edc_df": [
      { "subject_id": "A unique identifier assigned to each participant in the study." },
      { "visit_date": "The date on which the subject visited the clinical site or data was recorded." },
      { "dose_mg": "The amount of drug administered to the subject, measured in milligrams." },
      { "adverse_event": "Any undesirable experience or medical occurrence reported by the subject during the study." }
    ],
    "epro_df": [
      { "subject_id": "A unique identifier for the subject reporting symptoms (used to match with other datasets)." },
      { "symptom": "The type or name of the symptom reported by the subject (e.g., headache, nausea)." },
      {
        "severity": "The intensity level of the reported symptom, often on a predefined scale (e.g., mild, moderate, severe)."
      },
      { "report_date": "The date when the symptom was reported by the subject." }
    ],
    "ivrs_df": [
      {
        "subject_id": "A unique identifier assigned to each participant in the trial (used to match with other datasets)."
      },
      { "randomization_date": "The date on which the subject was randomly assigned to a treatment group." },
      { "drug_kit": "Identifier for the specific drug kit assigned to the subject." },
      { "country": "The country in which the subject is participating in the clinical trial." },
      {
        "dose_group": "The predefined dosing group or treatment arm to which the subject was assigned (e.g., low dose, high dose)."
      }
    ],
    "lab_df": [
      { "subject_id": "Unique identifier for each patient or subject." },
      { "test_name": "Name of the lab test performed (e.g., WBC, Hemoglobin)." },
      { "value": "Result of the lab test (numeric value)." },
      { "unit": "Measurement unit for the lab test result (e.g., mg/L, g/dL)." },
      { "lab_date": "Date when the lab test was conducted." }
    ],
    "entity_df": 
      [
        { "LEGALSTRUCTUREID": "Unique identifier for the legal structure of the entity." },
        { "ENTITYTYPEID": "Numerical code indicating the type of entity." },
        { "ENTITYSUBTYPEID": "Code representing the subtype of the entity." },
        { "ISBRANCHFLAG": "Flag indicating if the entity is a branch (Y/N)." },
        { "USGSEFLAG": "Flag showing if the entity is a U.S. Government-Sponsored Enterprise (Y/N)." },
        { "INCORPORATIONAUTHORITYNAME": "Name of the authority under which the entity is incorporated." },
        { "G-SIBFLAG": "Flag indicating if the entity is a Global Systemically Important Bank (Y/N)." },
        { "G-SIBNAME": "Name of the G-SIB if applicable." },
        { "SUPRANATIONALENTITYFLAG": "Flag denoting if the entity is supranational (Y/N)." },
        { "MULTILATERALDEVELOPMENTBANKFLAG": "Indicates if the entity is a multilateral development bank (Y/N)." },
        { "SOVEREIGNWEALTHFUNDFLAG": "Flag indicating if it's a sovereign wealth fund (Y/N)." },
        { "COMMUNITYDEVELOPMENTFINANCIALINSTITUTIONFLAG": "Flag for community development financial institution status (Y/N)." },
        { "INDUSTRIALLOANBANKFLAG": "Indicates if the entity is an industrial loan bank (Y/N)." },
        { "SWAPDEALERFLAG": "Flag showing if the entity is a swap dealer (Y/N)." },
        { "BALANCESHEETCONSOLIDATIONFLAG": "Flag for whether balance sheet is consolidated (Y/N)." },
        { "ANACREDITINSTITUTIONALSECTORID": "Code for the AnaCredit institutional sector." },
        { "ANACREDITLEGALFORMID": "Code representing AnaCredit legal form." },
        { "ANACREDITINSTITUTIONALSUBSECTORCODE": "Subsector code under AnaCredit classification." },
        { "STATUSOFLEGALPROCEEDINGSID": "Status code for ongoing or past legal proceedings." },
        { "DATEOFINITIATIONOFLEGALPROCEEDINGS": "Date when legal proceedings were initiated." },
        { "ENTERPRISESIZE": "Size category of the enterprise (e.g., small, medium, large)." },
        { "DATEOFENTERPRISESIZE": "Date when the enterprise size was recorded or determined." },
        { "NUMBEROFEMPLOYEES": "Total number of employees in the entity." },
        { "BALANCESHEETTOTAL": "Total value of the entity’s balance sheet." },
        { "ANNUALTURNOVER": "Total annual turnover or revenue of the entity." },
        { "BUSINESSSTATUS": "Current business status of the entity (e.g., ACTIVE, INACTIVE)." },
        { "BUSINESSSTATUSREASONCODE": "Code explaining the reason for business status (e.g., DISSOLVED)." },
        { "SPVDEBTISSUINGFLAG": "Flag for whether the entity is a Special Purpose Vehicle for debt issuance (Y/N)." },
        { "FMUFLAG": "Flag indicating if it's a Financial Market Utility (Y/N)." },
        { "FMIFLAG": "Flag showing Financial Market Infrastructure status (Y/N)." },
        { "FORMPFFLAG": "Flag denoting FORM PF filing status (Y/N)." }
      ]
  }
}
